#Использовать v8runner
#Использовать cmdline
#Использовать fs
#Использовать xml-parser


Функция ПолучитьUUIDКонфигурации(ПутьКФайлу)
    
    ПроцессорXML = Новый СериализацияДанныхXML();
    РезультатЧтения = ПроцессорXML.ПрочитатьИзФайла(ПутьКФайлу);
    
    Если РезультатЧтения = Неопределено Тогда
        Сообщить("Ошибка: Не удалось прочитать XML-файл");
        Возврат Неопределено;
    КонецЕсли;

    // Анализируем структуру XML
    ConfigDumpInfo = РезультатЧтения["ConfigDumpInfo"];
    Если ТипЗнч(ConfigDumpInfo) = Тип("Структура") Тогда
		Если ТипЗнч(ConfigDumpInfo["_Элементы"]["ConfigVersions"]) = Тип("Массив") Тогда
			Для каждого ЭлементМассива Из ConfigDumpInfo["_Элементы"]["ConfigVersions"] Цикл
				Для каждого ЭлементСоответствия Из ЭлементМассива Цикл
					ТекущаяСтруктура = ЭлементСоответствия.Значение;
					Если СтрНачинаетсяС(ТекущаяСтруктура["_Атрибуты"]["name"], "Configuration") Тогда
						Возврат ТекущаяСтруктура["_Атрибуты"]["id"];
					Иначе
						Продолжить;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
    
    Возврат Неопределено;
КонецФункции


Функция ПолучитьПолноеИмяФайла()
    
	ПарсерКоманднойСтроки = Новый ПарсерАргументовКоманднойСтроки();
    ПарсерКоманднойСтроки.ДобавитьПараметр("ПутьКФайлу");
    РазобранныеПараметры = ПарсерКоманднойСтроки.Разобрать(АргументыКоманднойСтроки);

	Возврат РазобранныеПараметры["ПутьКФайлу"];

КонецФункции

Процедура ВыгрузитьXMLФайл(ИмяФайла)

	КаталогXML = "C:\Practicum\xml";

	Конфигуратор = Новый УправлениеКонфигуратором();

	Конфигуратор.ЗагрузитьИнформационнуюБазу(ИмяФайла);

	СтрокаСоединения = "/F" + Конфигуратор.ПутьКВременнойБазе();
	Конфигуратор.УстановитьКонтекст(СтрокаСоединения, "Администратор", "");

	ПараметрыЗапуска = Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска.Добавить("/DumpConfigToFiles" + КаталогXML + " -configDumpInfoOnly"""); 

	Попытка
		Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска);
	Исключение
    	// вывод log-файла с сообщениями от платформы.
    	Сообщить(Конфигуратор.ВыводКоманды());
	КонецПопытки;

	ПолныйПутьXMLФайла = КаталогXML + "\" + "ConfigDumpInfo.xml";

	// найдем uuid конфигурации в xml-файле
	Если ФС.ФайлСуществует(ПолныйПутьXMLФайла) Тогда
		UUIDКонфигурации = ПолучитьUUIDКонфигурации(ПолныйПутьXMLФайла);
		Если UUIDКонфигурации <> Неопределено Тогда
    		Сообщить("UUID конфигурации: " + UUIDКонфигурации);
		Иначе
			Сообщить("UUID не найден!");
		КонецЕсли;
	Иначе
		Сообщить("xml-файл не найден");
	КонецЕсли;

	// удаление временной базы
	УдалитьФайлы(Конфигуратор.ПутьКВременнойБазе());

КонецПроцедуры

Процедура main()

	ПолноеИмяФайла = ПолучитьПолноеИмяФайла();

	Если ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		ВыгрузитьXMLФайл(ПолноеИмяФайла);
	КонецЕсли;

КонецПроцедуры

// oscript extract-config-uuid.os "C:\path\to\1Cv8.dt"
main();
