#Использовать v8runner
#Использовать cmdline
#Использовать fs
#Использовать xml-parser
#Использовать json


Функция ОБъектВJson(Знач Объект, ПараметрыЗаписи = Неопределено) Экспорт
	
	Если ПараметрыЗаписи = Неопределено Тогда
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, " ", ,,,,,, Истина);
	КонецЕсли;

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(ЗаписьJSON, Объект);
	
	Возврат ЗаписьJSON.Закрыть();

КонецФункции

Функция ОбъектИзJson(ТекстJSON, ЧитатьВСтруктуру = Ложь, ФорматДаты = Неопределено) Экспорт
		
	Если ФорматДаты = Неопределено Тогда
		ФорматДаты = ФорматДатыJSON.ISO;
	КонецЕсли;
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	
	Объект = ПрочитатьJSON(ЧтениеJSON,
							НЕ ЧитатьВСтруктуру,,
							ФорматДаты);
	ЧтениеJSON.Закрыть();
	Возврат Объект;
	 
КонецФункции

Функция ПолучитьВсеUUIDКонфигурации(Знач ПутьКФайлу) Экспорт

    ПроцессорXML = Новый СериализацияДанныхXML();
    РезультатЧтения = ПроцессорXML.ПрочитатьИзФайла(ПутьКФайлу);
    
    Если РезультатЧтения = Неопределено Тогда
        Сообщить("Ошибка: Не удалось прочитать XML-файл");
        Возврат Неопределено;
    КонецЕсли;

	МассивUUID = Новый Массив;

    // Анализируем структуру XML
    ConfigDumpInfo = РезультатЧтения["ConfigDumpInfo"];
    Если ТипЗнч(ConfigDumpInfo) = Тип("Структура") Тогда
		Если ТипЗнч(ConfigDumpInfo["_Элементы"]["ConfigVersions"]) = Тип("Массив") Тогда
			Для каждого ЭлементМассива Из ConfigDumpInfo["_Элементы"]["ConfigVersions"] Цикл
				Для каждого ЭлементСоответствия Из ЭлементМассива Цикл
					ТекущаяСтруктура = ЭлементСоответствия.Значение;
					
					НоваяСтрока  = Новый Соответствие();
					НоваяСтрока.Вставить(ТекущаяСтруктура["_Атрибуты"]["name"], ТекущаяСтруктура["_Атрибуты"]["id"]);
					МассивUUID.Добавить(НоваяСтрока);
					
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;

	Если МассивUUID.Количество() Тогда
		Возврат ОБъектВJson(МассивUUID);
	КонецЕсли;
    
	Возврат Неопределено;

КонецФункции

Функция ПолучитьUUIDКонфигурации(Знач ПутьКФайлу) Экспорт
    
    ПроцессорXML = Новый СериализацияДанныхXML();
    РезультатЧтения = ПроцессорXML.ПрочитатьИзФайла(ПутьКФайлу);
    
    Если РезультатЧтения = Неопределено Тогда
        Сообщить("Ошибка: Не удалось прочитать XML-файл");
        Возврат Неопределено;
    КонецЕсли;

    // Анализируем структуру XML
    ConfigDumpInfo = РезультатЧтения["ConfigDumpInfo"];
    Если ТипЗнч(ConfigDumpInfo) = Тип("Структура") Тогда
		Если ТипЗнч(ConfigDumpInfo["_Элементы"]["ConfigVersions"]) = Тип("Массив") Тогда
			Для каждого ЭлементМассива Из ConfigDumpInfo["_Элементы"]["ConfigVersions"] Цикл
				Для каждого ЭлементСоответствия Из ЭлементМассива Цикл
					ТекущаяСтруктура = ЭлементСоответствия.Значение;
					Если СтрНачинаетсяС(ТекущаяСтруктура["_Атрибуты"]["name"], "Configuration") Тогда
						Возврат ОБъектВJson(Новый Структура("UUID", ТекущаяСтруктура["_Атрибуты"]["id"]));
					Иначе
						Продолжить;
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
    
    Возврат Неопределено;
КонецФункции


Функция ПолучитьПолноеИмяФайла()
    
	ПарсерКоманднойСтроки = Новый ПарсерАргументовКоманднойСтроки();
    ПарсерКоманднойСтроки.ДобавитьПараметр("ПутьКФайлу");
    РазобранныеПараметры = ПарсерКоманднойСтроки.Разобрать(АргументыКоманднойСтроки);

	Возврат РазобранныеПараметры["ПутьКФайлу"];

КонецФункции

Процедура ВыгрузитьXMLФайл(ИмяФайла)

	КаталогXML = "C:\Practicum\xml";

	Конфигуратор = Новый УправлениеКонфигуратором();

	Конфигуратор.ЗагрузитьИнформационнуюБазу(ИмяФайла);

	СтрокаСоединения = "/F" + Конфигуратор.ПутьКВременнойБазе();
	Конфигуратор.УстановитьКонтекст(СтрокаСоединения, "Администратор", "");

	ПараметрыЗапуска = Конфигуратор.ПолучитьПараметрыЗапуска();
	ПараметрыЗапуска.Добавить("/DumpConfigToFiles" + КаталогXML + " -configDumpInfoOnly"""); 

	Попытка
		Конфигуратор.ВыполнитьКоманду(ПараметрыЗапуска);
	Исключение
    	// вывод log-файла с сообщениями от платформы.
    	Сообщить(Конфигуратор.ВыводКоманды());
	КонецПопытки;

	ПолныйПутьXMLФайла = КаталогXML + "\" + "ConfigDumpInfo.xml";

	// найдем uuid конфигурации в xml-файле
	Если ФС.ФайлСуществует(ПолныйПутьXMLФайла) Тогда
		UUIDКонфигурации = ПолучитьUUIDКонфигурации(ПолныйПутьXMLФайла);
		Если UUIDКонфигурации <> Неопределено Тогда
    		Сообщить(UUIDКонфигурации);
		Иначе
			Сообщить("UUID не найден!");
		КонецЕсли;

	Иначе
		Сообщить("xml-файл не найден");
	КонецЕсли;

	// удаление временной базы
	УдалитьФайлы(Конфигуратор.ПутьКВременнойБазе());

КонецПроцедуры

Процедура main()

	ПолноеИмяФайла = ПолучитьПолноеИмяФайла();

	Если ЗначениеЗаполнено(ПолноеИмяФайла) Тогда
		ВыгрузитьXMLФайл(ПолноеИмяФайла);
	КонецЕсли;

КонецПроцедуры

// oscript extract-config-uuid.os "C:\path\to\1Cv8.dt"
main();
